* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
**SAG GENERATOR: NJXProgramGenerator                      VERSION: 9.3.2
**SAG adapter: AJAX.NS8
**SAG DESCS(1): NJX Program to execute AJAX.NS8
************************************************************************
* Program  : AJAXP
* System   : WORKPLAN
* Title    : Module ...
* Generated: Fri Mar 28 15:23:28 CET 2025
* Function : NJX Program to execute AJAX.NS8
*
*
*
* History
**SAG DEFINE EXIT CHANGE-HISTORY
**SAG END-EXIT
************************************************************************

DEFINE DATA LOCAL
/* PARAMETERS from parsed adapter
1 LINES (1:*)
  2 LI (A) DYNAMIC
  2 SELECTED (L)
1 OUTLINES (1:*)
  2 COLUMN (A) DYNAMIC
  2 SELECTED (L)
1 OUTPUT (A) DYNAMIC
1 TITLETXT (A) DYNAMIC
**SAG DEFINE EXIT DEFINE-DATA
1 #i (i4)
1 #o (i4)
1 #title (a10)
**SAG END-EXIT
END-DEFINE

**SAG DEFINE EXIT BEFORE-PROCESS-PAGE
TITLETXT := "Klein aber fein"
output := *opsys
expand array LINES to (1:5)
expand array OUTLINES to (1:5)
LINES.li(1) := "Hallo"
lines.li(2) := "Welt"
LINES.li(3) := "wie"
lines.li(4) := "geht"
lines.li(5) := "es"
lines.SELECTED(3) := true
**SAG END-EXIT
*
PROCESS PAGE USING "AJAX"
*
**SAG DEFINE EXIT AFTER-PROCESS-PAGE
**SAG END-EXIT
*
DECIDE ON FIRST *PAGE-EVENT
/* Values from Event handler section
  VALUE U'nat:page.end'
**SAG DEFINE EXIT EVENT-nat:page.end
    escape routine
    PROCESS PAGE UPDATE FULL
**SAG END-EXIT
  VALUE U'lines.reactOnContextMenuRequest'
**SAG DEFINE EXIT EVENT-lines.reactOnContextMenuRequest
    PROCESS PAGE UPDATE FULL
**SAG END-EXIT
  VALUE U'onExit'
**SAG DEFINE EXIT EVENT-onExit
    escape routine
    PROCESS PAGE UPDATE FULL
**SAG END-EXIT
  VALUE U'onOk'
**SAG DEFINE EXIT EVENT-onOk
    #o := 1
    reset OUTLINES(*)
    for #i = 1 to 5
      if lines.SELECTED(#i)
        OUTLINES.COLUMN(#o) := LINES.LI(#i)
        add 1 to #o
      end-if
    end-for
    PROCESS PAGE UPDATE FULL
**SAG END-EXIT
  VALUE U'outlines.reactOnContextMenuRequest'
**SAG DEFINE EXIT EVENT-outlines.reactOnContextMenuRequest
    PROCESS PAGE UPDATE FULL
**SAG END-EXIT
  NONE VALUE
**SAG DEFINE EXIT EVENT-NONE-VALUE
    PROCESS PAGE UPDATE
**SAG END-EXIT
END-DECIDE

**SAG DEFINE EXIT MISC-SUBROUTINES
**SAG END-EXIT

END
