* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
**SAG GENERATOR: NJXProgramGenerator                      VERSION: 9.3.2
**SAG adapter: AJAX.NS8
**SAG DESCS(1): NJX Program to execute AJAX.NS8
************************************************************************
* Program  : AJAXP
* System   : WORKPLAN
* Title    : Module ...
* Generated: Thu Feb 06 10:20:39 CET 2025
* Function : NJX Program to execute AJAX.NS8
*
*
*
* History
**SAG DEFINE EXIT CHANGE-HISTORY
**SAG END-EXIT
************************************************************************

** Parse Parameter error: Unable to find '*( PARAMETER'

**SAG DEFINE EXIT BEFORE-PROCESS-PAGE
**SAG END-EXIT
*
PROCESS PAGE USING "AJAX"
*
**SAG DEFINE EXIT AFTER-PROCESS-PAGE
**SAG END-EXIT
*
DECIDE ON FIRST *PAGE-EVENT
/* Values from Event handler section
  VALUE U'nat:page.end'
**SAG DEFINE EXIT EVENT-nat:page.end
    PROCESS PAGE UPDATE FULL
**SAG END-EXIT
  VALUE U'onExit'
**SAG DEFINE EXIT EVENT-onExit
    PROCESS PAGE UPDATE FULL
**SAG END-EXIT
  NONE VALUE
**SAG DEFINE EXIT EVENT-NONE-VALUE
    PROCESS PAGE UPDATE
**SAG END-EXIT
END-DECIDE

**SAG DEFINE EXIT MISC-SUBROUTINES
**SAG END-EXIT

END
