* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
/** New Program CALCP.
/**
/** :author msu
/* TODO Enter your code here
define data 
local
1 #a (a10/1:10,1,10)
1 #f (f8)
1 #n (n14.15)
1 #p (p14.15)
end-define
#n := exp(1)
#f := exp(1)
#p := exp(1)
#n := 2**10
write #n
END
