* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
**SAG GENERATOR: NJXProgramGenerator                      VERSION: 9.3.2
**SAG adapter: NEW1.NS8
**SAG DESCS(1): NJX Program to execute NEW1.NS8
************************************************************************
* Program  : CUSTAJP
* System   : WORKPLAN
* Title    : Module ...
* Generated: Mon Jan 27 11:22:35 CET 2025
* Function : NJX Program to execute NEW1.NS8
*
*
*
* History
**SAG DEFINE EXIT CHANGE-HISTORY
**SAG END-EXIT
************************************************************************

DEFINE DATA LOCAL
/* PARAMETERS from parsed adapter
1 ANREDE (A) DYNAMIC
1 NAME (A) DYNAMIC
**SAG DEFINE EXIT DEFINE-DATA
**SAG END-EXIT
END-DEFINE

**SAG DEFINE EXIT BEFORE-PROCESS-PAGE
**SAG END-EXIT
*
PROCESS PAGE USING "NEW1"
*
**SAG DEFINE EXIT AFTER-PROCESS-PAGE
**SAG END-EXIT
*
DECIDE ON FIRST *PAGE-EVENT
/* Values from Event handler section
  VALUE U'nat:page.end'
**SAG DEFINE EXIT EVENT-nat:page.end
    PROCESS PAGE UPDATE FULL
**SAG END-EXIT
  VALUE U'onExit'
**SAG DEFINE EXIT EVENT-onExit
    PROCESS PAGE UPDATE FULL
**SAG END-EXIT
  VALUE U'onLoad'
**SAG DEFINE EXIT EVENT-onLoad
    name := "Fehlt"
    anrede := "Fehlt"
    PROCESS PAGE UPDATE FULL
**SAG END-EXIT
  NONE VALUE
**SAG DEFINE EXIT EVENT-NONE-VALUE
    PROCESS PAGE UPDATE
**SAG END-EXIT
END-DECIDE

**SAG DEFINE EXIT MISC-SUBROUTINES
**SAG END-EXIT

END
