DEFINE DATA LOCAL
/* >Natural Source Header 000000
/* :Mode S
/* :CP
/* <Natural Source Header
*  /** New Local Data Area CUSTL.
*  /**
*  /** :author msu
*  /* TODO Enter your data definitions here
1 CUST VIEW OF CUSTOMERS
  2 CUSTID
  2 FIRSTNAME
  2 LASTNAME 
  2 ADDRESS 
  2 C*PHONE
  2 PHONE (A10/1:10)
  2 C*KIND
  2 KIND (1:20)
    3 VALUE 
    3 KEY 
  2 C*SPECIAL
  2 SPECIAL (1:5)
    3 C*REMARKS
    3 REMARKS (A10/1:10)
    3 C*CODES
    3 CODES (A5/1:20)
  2 ZIP
  2 CITY
  2 L@LONGTXT
  2 LONGTXT
  2 EMAIL
END-DEFINE
