* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
/** New Program CUSTP.
/**
/** :author msu
/* TODO Enter your code here
DEFINE DATA LOCAL USING CUSTA
END-DEFINE
/* callnat nix
/* was neues
write 'Und los wieder ...'
CALLNAT 'custn' CUSTOMER(*)
DISPLAY *DEVICE *OPSYS CUSTOMER(*)
END
