* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
/** New Program DATEP.
/**
/** :author msu
/* TODO Enter your code here
DEFINE DATA
LOCAL
1 #JU2   (A07)
1 #JU2-D (D)
END-DEFINE
*
MOVE EDITED *DATX (EM=YYYYJJJ) TO #JU2
SET KEY PF3
R1. REPEAT
  INPUT (AD=M'_') #JU2 '<== YYYYJJJ'
  IF *PF-KEY = 'PF3' OR #JU2 = ' '
    ESCAPE MODULE
  END-IF
*
  IF #JU2 = MASK(YYYYJJJ)
    MOVE EDITED #JU2 TO #JU2-D (EM=YYYYJJJ)
    WRITE '=' #JU2 '=' #JU2-D
  ELSE
    WRITE 'invalid' '=' #JU2
  END-IF
END-REPEAT   /* R1.
END
