* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
/** New Program NEW2P.
/**
/** :author msu
/* TODO Enter your code here
write "Hallo Welt neu"
END
