* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
DEFINE DATA LOCAL 
1 CUST VIEW OF CUSTOMERS
  2 CUSTID
  2 FIRSTNAME
  2 LASTNAME
  2 LONGTXT
END-DEFINE
READ CUST
  WRITE CUSTID FIRSTNAME LASTNAME 
  WRITE LONGTXT (al=79)
END-READ
END
