DB: 100 FILE: 010  - TEMP                             DEFAULT SEQUENCE: 
TYPE: ADABAS 
 
T L DB Name                              F Leng  S D Remark
- - -- --------------------------------  - ----  - - ------------------------
*      >Natural Source Header 000000
*      :CP
*      
*      
*      <Natural Source Header
  1 AA AA-1                              A   10    D 
  1 AB AB-1                              A   20      
  1 AC AC-1                              A   20      
  1 AD AD-1                              U   25    D 
M 1 M1 M1-1                              A   10  N D 
P 1 PE PE-1                                          
  2 P1 P1-1                              A   10  N   
  2 P2 P2-1                              A    5  N   
P 1 PM PM-1                                          
M 2 P3 P3-1                              A   10  N   
M 2 P4 P4-1                              A    5  N   
******DDM OUTPUT TERMINATED******
