* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
/** New Program CUSTP.
/**
/** :author msu
/* TODO Enter your code here
define data local using custa
end-define
callnat 'custn' CUSTOMER(*)
display CUSTOMER(*)
END
