DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 CUSTOMER(100) /*
  2 CUSTID (A10)
  2 FIRSTNAME (A20)
  2 LASTNAME (A20)
END-DEFINE
