DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 CUSTXA 
  2 CUSTOMER(*) 
   3 CUSTID (A10) 
   3 FIRSTNAME (A20)
   3 LASTNAME (A20)
  2 NUMBER (i4)
END-DEFINE
