* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
/** New Program CUSTP.
/**
/** :author msu
/* TODO Enter your code here
define data local using custxa
local
1 #i (i4)
end-define
/* callnat
custxa.NUMBER := 10
callnat 'custxn' custxa
for #i = 1 to custxa.NUMBER
   display #i CUSTOMER(#i)
end-for
END