* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
define data local
/* test von Mathias
1 emp view of employees
  2 aa-1 (a8)
  2 ac-1 (a20)
  2 ae-1 (a20)
1 cust view of customers
  2 custid (a10)
  2 firstname (a20)
  2 lastname (a20)
end-define
read emp
custid := aa-1
firstname := ac-1
lastname := ae-1
store cust
end-read
end transaction
end
