* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
define data local
1 cust view of customers
  2 custid (a10)
  2 firstname (a20)
  2 lastname (a20)
end-define
define printer (1) output 'LPT1'
read(100) cust
write (1) custid firstname lastname
end-read
end
