DB: 100 FILE: 010  - CUSTOMERS                        DEFAULT SEQUENCE:   
TYPE: ADABAS
 
T L DB Name                              F Leng  S D Remark
- - -- --------------------------------  - ----  - - ------------------------
*      >Natural Source Header 000000
*      :CP
*      UTF-8
*      
*      :LineIncrement 10
*      <Natural Source Header
  1 AA CUSTID                            A   10    D 
  1 AX L@NOTES                           I    4      LEN. IND. OF AX-1
  1 AB FIRSTNAME                         A   20      
  1 AC LASTNAME                          A   20      
  1 AD ADDRESS                           U   25    D 
M 1 M1 PHONE                             A   10  N D 
P 1 PE KIND                                          
  2 P1 VALUE                             A   10  N   
  2 P2 KEY                               A    5  N   
P 1 PM SPECIAL                                       
M 2 P3 REMARKS                           A   10  N   
M 2 P4 CODES                             A    5  N   
  1 AX NOTES                             A           LOB
       DY
       OPTIONS=LB
******DDM OUTPUT TERMINATED******
