* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
DEFINE DATA LOCAL USING CUSTL
LOCAL
1 #ID (N8)
1 #I (I4)
1 #I2 (I4)
1 #I3 (I4)
1 #CN (I4)
1 #VALUE (A10/1:20) CONST<'eins','zwei','drei','vier','fünf','sechs','sieben','acht','neun','zehn',
 'elf','zwölf','dreizehn','vierzehn','fünfzehn','sechzehn','siebzehn','achtzehn','neunzehn','zwanzig'>
END-DEFINE
#ID:= 55000000
READ(1) CUST BY CUSTID = '55009354'
* READ CUST
* ADD 1 TO #ID
* CUST.CUSTID := #ID
WRITE CUST.CUSTID CUST.LASTNAME CUST.FIRSTNAME
WRITE CUST.ADDRESS
*  RESET CUST.PHONE(*)
*  #I := (RAND(<>) * 10) +1
*  IF #I < 11 
*      FOR #CN = 1 TO #I
*          COMPRESS 'Phone' #CN INTO CUST.PHONE(#CN)
*      END-FOR
*  END-IF
*  RESET CUST.C*KIND
*  #I := (RAND(<>) * 20) +1
*  IF #I < 21 
*      FOR #CN = 1 TO #I
*          COMPRESS 'K' #CN INTO CUST.KEY(#CN)
*          COMPRESS 'V' #VALUE(#CN) INTO CUST.VALUE(#CN)
*      END-FOR     
*  END-IF
*  RESET CUST.SPECIAL(*)
*  #I := (RAND(<>) * 5) +1
*  IF #I < 6 
*      FOR #CN = 1 TO #I
*          #I2 := (RAND(<>) * 10) +1
*          FOR #I3 = 1 TO #I2
*              COMPRESS 'Remark' #CN #I3 INTO CUST.REMARKS(#CN,#I3) 
*          END-FOR
*          #I2 := (RAND(<>) * 5) +1
*          FOR #I3 = 1 TO #I2
*              COMPRESS 'C' #CN #I3 INTO CUST.CODES(#CN,#I3) 
*          END-FOR
*      END-FOR
*  END-IF
 #I := CUST.C*PHONE
 IF #I > 0 
     WRITE CUST.PHONE (1:#I)
 END-IF
 #I := CUST.C*KIND
 IF #I > 0
     WRITE CUST.KEY(1:#I) 
     WRITE CUST.VALUE(1:#I)
END-IF
#I := CUST.C*SPECIAL
 IF #I > 0
     #I2 := CUST.C*REMARKS(#I)
     WRITE CUST.REMARKS(1:#I,1:#I2) 
     #I2 := CUST.C*CODES(#I)
     WRITE CUST.CODES(1:#I,1:#I2)
END-IF

* UPDATE
END-READ
* END TRANSACTION
END
