* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
DEFINE DATA LOCAL USING CUSTL
LOCAL 
1 #I (I4)
1 #I2 (I4)
END-DEFINE
READ CUST
** WRITE CUSTID FIRSTNAME LASTNAME 
** WRITE NOTES (AL=79)
#I := (RAND(<>) * 2000) +1
RESET NOTES
FOR #I2 = 1 TO #I
 COMPRESS NOTES #I2 INTO NOTES
END-FOR
UPDATE
END TRANSACTION
END-READ
END
