* >Natural Source Header 000000
* :Mode S
* :CP UTF-8
* :LineIncrement 10
* <Natural Source Header
DEFINE DATA
LOCAL
1 #I (I4)
END-DEFINE
#I:=0
REPEAT
SET CONTROL 'N'
#I := #I + 1
INPUT(AD=IO) *DATN *TIMX  #I
IF #I > 100000
  ESCAPE BOTTOM
END-IF
END-REPEAT
END
