DEFINE DATA LOCAL
/* >Natural Source Header 000000
/* :Mode S
/* :CP
/* <Natural Source Header
*  /** New Local Data Area CUSTL.
*  /**
*  /** :author msu
*  /* TODO Enter your data definitions here
1 CUST VIEW OF CUSTOMERS
  2 CUSTID (A10)
  2 FIRSTNAME (A20)
  2 LASTNAME (A20)
  2 ADDRESS (U50)
  2 C*PHONE
  2 PHONE (A10/1:10)
  2 C*KIND
  2 KIND (1:20)
    3 VALUE (A10)
    3 KEY (A5)
  2 C*SPECIAL
  2 SPECIAL (1:5)
    3 C*REMARKS
    3 REMARKS (A10/1:10)
    3 C*CODES
    3 CODES (A5/1:20)
END-DEFINE
