* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
/** New Program SECONP.
/**
/** :author msu
/* TODO Enter your code here
write 'Hallo'
write *opsys
END
