* >Natural Source Header 000000
* :Mode S
* :CP UTF-8
* :LineIncrement 10
* <Natural Source Header
DEFINE DATA
LOCAL
 1 USR6202L
   2 INPUTS
     3 FUNCTION        (A01)
     3 ENV-VARIABLE    (A80)
     3 CHAR-STRING     (A253)
   2 OUTPUTS
     3 RESPONSE        (I04)
 1 ANSWER              (A1)
 1 SET-CHAR-STRING     (A253)
END-DEFINE
/* alter Code ******************************************************************************************
USR6202L.ENV-VARIABLE := 'SAG'
CALL 'GETENV' USR6202L.ENV-VARIABLE USR6202L.CHAR-STRING
WRITE 'CALL' USR6202L.CHAR-STRING (AL=79)
/*******************************************************************************************************
/* Besser : neuer Code mit dem ausgelieferten Subprogramm USR6202N zum Setzen und Lesen von EVIRON Vars
USR6202L.FUNCTION := 'G'
USR6202L.ENV-VARIABLE := 'SAG'
CALLNAT 'USR6202N'  USR6202L
WRITE 'USR' USR6202L.CHAR-STRING (AL=79)
/*******************************************************************************************************
END
